_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
separable_conv2d_1 (Separabl (None, 94, 94, 64)        283       
_________________________________________________________________
separable_conv2d_2 (Separabl (None, 92, 92, 32)        2656      
_________________________________________________________________
separable_conv2d_3 (Separabl (None, 90, 90, 32)        1344      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 45, 45, 32)        0         
_________________________________________________________________
separable_conv2d_4 (Separabl (None, 43, 43, 32)        1344      
_________________________________________________________________
separable_conv2d_5 (Separabl (None, 41, 41, 32)        1344      
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 20, 20, 32)        0         
_________________________________________________________________
separable_conv2d_6 (Separabl (None, 18, 18, 32)        1344      
_________________________________________________________________
separable_conv2d_7 (Separabl (None, 16, 16, 32)        1344      
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 8, 8, 32)          0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 8, 8, 32)          0         
_________________________________________________________________
global_average_pooling2d_1 ( (None, 32)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 256)               8448      
_________________________________________________________________
dense_2 (Dense)              (None, 2)                 514       
=================================================================
Total params: 18,621
Trainable params: 18,621
Non-trainable params: 0
_________________________________________________________________