_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
mobilenetv2_1.00_96 (Model)  (None, 1280)              2257984   
_________________________________________________________________
dense_1 (Dense)              (None, 256)               327936    
_________________________________________________________________
dense_2 (Dense)              (None, 2)                 514       
=================================================================
Total params: 2,586,434
Trainable params: 2,552,322
Non-trainable params: 34,112
_________________________________________________________________